---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarCoupler
source: html/af258367-f0c5-e4d3-f863-1733d7bf6b30.htm
---
# Autodesk.Revit.DB.Structure.RebarCoupler

Represents a rebar coupler element in Autodesk Revit.

## Syntax (C#)
```csharp
public class RebarCoupler : Element
```